const article1 = {
    id: "bagirov_article_1",
    title: "Теракты 11 сентября",
    photoPath: "../res/drawable/teract.jpg",
    eventDate: "11 сентября 2001 года",
    text: "Утром того дня четыре группы террористов общим количеством 19 человек захватили четыре рейсовых пассажирских самолёта. Каждая группа имела как минимум одного члена, прошедшего начальную лётную подготовку. Захватчики направили два лайнера в башни ВТЦ, расположенные в южной части Манхэттена в Нью-Йорке. Рейс 11 American Airlines врезался в башню ВТЦ-1 (Северную), а рейс 175 United Airlines — в башню ВТЦ-2 (Южную). В результате этого обе башни обрушились, вызвав серьёзные разрушения прилегающих строений[5]. Третий самолёт (рейс 77 American Airlines) был направлен в здание Пентагона, расположенное недалеко от Вашингтона. Пассажиры и команда четвёртого авиалайнера (рейс 93 United Airlines) попытались перехватить управление самолётом у террористов[6], самолёт упал в поле около боро Шанксвилл в штате Пенсильвания. Вместе с тем, существуют и конспирологические версии произошедшего, расходящиеся с официальной версией.Помимо 19 террористов, в результате атак погибло 2977 человек[⇨], ещё 24 пропали без вести. Большинство погибших были гражданскими лицами[7]. Теракт стал крупнейшим в истории по числу жертв[8].Последствиями этих терактов стали акты возмездия войск НАТО против «Аль-Каиды» и «Талибана» в Афганистане и Пакистане и интервенция американских войск и их союзников в Ирак, приведшая к свержению режима Саддама Хусейна.", 
    description: "Террористи́ческие а́кты 11 сентября́ 2001 го́да (также именуемые 9/11)[1] — серия из четырёх координированных террористических актов-самоубийств, совершённых в Соединённых Штатах Америки членами террористической организации «Аль-Каида».",
    publicationDate: (new Date()).getTime(),
    authorEmail: "bagirov.alex@yandex.ru",
    likes: 100500,
    comments: [
        {
            authorEmail: "bagirov.alex@yandex.ru",
            text: "Действительно ужасное события. Мои соболезнования всем пострадавшим от рук террористов!",
            date: (new Date).getTime() 
        }
    ]
};
const article2 = {
    id: "bagirov_article_2",
    title: "Пандемия COVID-19",
    photoPath: "../res/drawable/pandemia.jpg",
    eventDate: "1 марта 2020 года",
    text: "В основном вирус SARS-CoV-2 передаётся при тесном контакте[a], чаще всего через небольшие капли[en], образующиеся при кашле[b], чихании и разговоре[21][23][24]. Капли обычно падают на землю или на поверхности, а не перемещаются по воздуху на большие расстояния[21][23][25]. Передача может также происходить через более мелкие капли, которые способны оставаться взвешенными в воздухе в течение более длительных периодов времени[26]. Реже возможно заражение после прикосновения к загрязнённой поверхности, а затем к лицу. Инфицированный наиболее заразен в течение первых трёх дней после появления симптомов, хотя распространение возможно и до появления симптомов, а также через людей, не проявляющих симптомов[21][23].К распространённым симптомам относятся лихорадка, кашель, утомление, одышка, потеря вкуса и аносмия (потеря обоняния)[23][28][29], возможна заложенность ушей[30]. При осложнениях могут возникать острый респираторный дистресс-синдром (ОРДС) и пневмония (воспаление лёгких)[31]. Инкубационный период, то есть отрезок времени от момента заражения до проявления симптомов, обычно составляет около 5 дней, но может варьироваться от 2 до 14 дней[32][33]. Поскольку нет никаких противовирусных препаратов для лечения заболевания[23], первичное лечение производится при помощи симптоматической терапии (устранение отдельных симптомов)[34]. С конца 2020 года существует несколько вакцин против COVID-19, ряд стран начал массовую вакцинацию против COVID-19[35][36].", 
    description: "Вспышка заболеваемости вирусом впервые была зафиксирована в Ухане, Китай, в декабре 2019 года[7][8][9]. 30 января 2020 года Всемирная организация здравоохранения (ВОЗ) объявила эту вспышку чрезвычайной ситуацией в области общественного здравоохранения, имеющей международное значение, а 11 марта — пандемией[10][11]. По состоянию на 21 ноября 2023 года зарегистрировано свыше 772 миллиона случаев заболевания по всему миру; подтверждено более 6,9 млн летальных исходов заболевания[3], что делает пандемию COVID-19 одной из самых смертоносных в истории[12].",
    publicationDate: (new Date()).getTime(),
    authorEmail: "bagirov.alex@yandex.ru",
    likes: 100500,
    comments: [
        {
            authorEmail: "bagirov.alex@yandex.ru",
            text: "Как переживший это событие, скажу: это было ужасно!",
            date: (new Date).getTime() 
        }
    ]
};
const article3 = {
    id: "bagirov_article_3",
    title: "Арабская весна",
    photoPath: "../res/drawable/protests.jpg",
    eventDate: "17 декабря 2010 года",
    text: "С осени 2010 года в 20 странах произошли революции в Тунисе[2], в Египте[3] и в Йемене[4]; гражданские войны в Ливии[5] (привела к смене власти), в Йемене и в Сирии[6] (продолжаются); гражданское восстание в Бахрейне[7]; массовые протесты в Алжире[8], в Ираке[9], в Иордании[10], в Марокко[11] и в Омане[12]; и менее значительные протесты в Азербайджане[13], Кувейте[14], Ливане[15], Мавритании, Саудовской Аравии[16], Судане[17], Джибути[18] и Западной Сахаре[19]. Столкновения на границе Израиля в мае 2011 года также были вдохновлены местной Арабской весной[20].В ходе протестов использовались общие методы гражданского сопротивления в длительных кампаниях: протесты, акции, забастовки, пикеты и пикетирования, манифестации, демонстрации, шествия и митинги, а также использование социальных медиа для организации, общения и информирования при попытках государственных репрессий и интернет-цензуры[21]. Многие демонстрации были встречены насильственной реакцией властей[22][23][24], а также проправительственных ополченцев и контр-демонстрантов[25][26][27]. Основным лозунгом демонстрантов в арабском мире был «Народ хочет падения режима»[28] ", 
    description: "Серия антиправительственных протестов, восстаний и вооружённых мятежей, охвативших большую часть арабского мира — страны Ближнего Востока и Северной Африки в начале 2010-х годов.",
    publicationDate: (new Date()).getTime(),
    authorEmail: "bagirov.alex@yandex.ru",
    likes: 100500,
    comments: [
        
    ]
};


function loadAdmins() {
    const users = JSON.parse(localStorage.getItem('users')) || [];
    if (users.length == 0) {
        const bagirov = {
            username: "bagirov",
            email: "bagirov.alex@yandex.ru",
            password: "lizards_must_die",
            articles: [article1, article2, article3]
        };
        localStorage.setItem('users', JSON.stringify([bagirov]));
    }
}

function loadArticles() {
    const articles = JSON.parse(localStorage.getItem('articles')) || [];
    if (articles.length == 0) {
        localStorage.setItem('articles', JSON.stringify([article1, article2, article3]));
        localStorage.setItem('bestArticles', JSON.stringify([article1, article2, article3]));
    }
}

loadAdmins();
loadArticles();